server/app/controllers/locations_controller.rb

SELECT "visits".* FROM "visits" WHERE "visits"."location_id" = $1  [["location_id", 4]]
---
  def filter_by_language
    #stub
    locations = Language.first.locations
    visits = User.first.visits