server/app/controllers/locations_controller.rb

  def index
    locations = Location.all
---
SELECT "locations".* FROM "locations"

  def create
    language = User.first.languages.first
    location = Location.new(location_params)
    user = User.first

    if location.save
      LanguageLocation.create(language: language, location: location)
---
SELECT "languages".* FROM "languages" INNER JOIN "user_languages" ON "languages"."id" = "user_languages"."language_id" WHERE "user_languages"."user_id" = $1 ORDER BY "languages"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "locations" ("name", "lat", "lng", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "language_locations" ("language_id", "location_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["language_id", 1], ["location_id", 10], ["created_at", "2020-08-16 01:19:19.798204"], ["updated_at", "2020-08-16 01:19:19.798204"]]
INSERT INTO "locations" ("name", "lat", "lng", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["lat", 40.74113555508701], ["lng", -73.90641040136717], ["description", ""], ["created_at", "2020-08-18 01:19:09.711964"], ["updated_at", "2020-08-18 01:19:09.711964"]]

  def filter_by_language
    #stub
    locations = Language.first.locations
    visits = User.first.visits
    updated_locations = locations.map do |location|
      if visits.any? { |visit| visit[:location_id] == location.id }
---
SELECT "languages".* FROM "languages" ORDER BY "languages"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "locations".* FROM "locations" INNER JOIN "language_locations" ON "locations"."id" = "language_locations"."location_id" WHERE "language_locations"."language_id" = $1  [["language_id", 1]]
SELECT "languages".* FROM "languages" ORDER BY "languages"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 1]]
SELECT "locations".* FROM "locations" INNER JOIN "language_locations" ON "locations"."id" = "language_locations"."location_id" WHERE "language_locations"."language_id" = $1 LIMIT $2  [["language_id", 1], ["LIMIT", 11]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "visits".* FROM "visits" WHERE "visits"."user_id" = $1  [["user_id", 1]]
SELECT "languages".* FROM "languages"