server/app/controllers/locations_controller.rb

SELECT "languages".* FROM "languages" INNER JOIN "user_languages" ON "languages"."id" = "user_languages"."language_id" WHERE "user_languages"."user_id" = $1 AND "languages"."name" = $2 LIMIT $3  [["user_id", 1], ["name", "Spanish"], ["LIMIT", 1]]
---
  def create
    # byebug
    language = User.first.languages.select { |language| language.name == request.headers['currentLanguage'] }.first

SELECT "languages".* FROM "languages" WHERE "languages"."name" = $1 LIMIT $2  [["name", "Manderine"], ["LIMIT", 1]]
SELECT "languages".* FROM "languages" WHERE "languages"."name" = $1 LIMIT $2  [["name", "undefined"], ["LIMIT", 1]]
SELECT "visits".* FROM "visits" WHERE "visits"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 11]]
---
  def filter_by_language
    #stub
    locations = Language.find_by(name: request.headers[:currentLanguage]).locations

    visits = User.first.visits
    updated_locations = locations.map do |location|
      if visits.any? { |visit| visit[:location_id] == location.id }