server/app/controllers/user_languages_controller.rb

  def index
    user =  User.first
    languages = user.user_languages.map do |user_language|
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "user_languages".* FROM "user_languages" WHERE "user_languages"."user_id" = $1  [["user_id", 1]]

  def create
    user = User.first
    # byebug
    post = JSON.parse request.raw_post
    if User.first.languages.any? {|language| language.id === post["language_id"] }
      user_language = {}
    else
      user_language = UserLanguage.create(user_id: params[:user_id], language_id: params[:language_id]).language
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "user_languages" ("user_id", "language_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["language_id", 2], ["created_at", "2020-08-17 15:49:44.416272"], ["updated_at", "2020-08-17 15:49:44.416272"]]