server/app/controllers/visits_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
INSERT INTO "visits" ("user_id", "location_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["location_id", 11], ["created_at", "2020-08-16 19:22:23.445586"], ["updated_at", "2020-08-16 19:22:23.445586"]]
---
  def create
    # byebug
    user = User.first
    location = Location.find(params[:id])
    visit = Visit.create(user: user, location: location)